# Проектування БД Лр №1

Роботу виконали

Группа: ІО-45

Студенти: Тірський Д, Ференчук З.

Роботу перевірив: Русінов В.В.

Київ, 2026

📋 Огляд проєкту

Тема - збір вимог та розробка ER. Мета - підготовка до наступних лабораторних робіт: реалізація моделі у вигляді таблиць PostgreSQL, написання SQL-запитів (OLTP/OLAP) та застосування нормалізації та міграцій.

🏗️ Хід роботи

У процесі виконання було проведено аналіз потреб користувача, створено концепцію БД та розроблено ER-діаграм.

Призначення БД:

Створення бази даних для цифрового магазину ігор, що дозволяє користувачам реєструватися, переглядати каталог та здійснювати покупки.

Дані, що зберігаються:

Інформація про користувачів (логіни, контактні дані).
Детальний опис ігор.
Повна історія замовлень.
Бізнес правила: Замовлення не можуть бути опрацьовані без прив’язки до існуючого користувача.

📊 Структура даних (ER)

<img width="655" height="687" alt="Снимок экрана 2026-02-11 в 19 35 08" src="https://github.com/user-attachments/assets/06a618c5-1b85-4d2e-80eb-03913985b394" />


Сутності та їх атрибути

Сутність,Атрибути
Користувач (User),UserID(PK),Nickname,Email(Unique),Password,RegDate
Публікація (Post),PostID(PK),UserID(FK),Title,Content,CreatedAt
Коментар (Comment),CommentID(PK),PostID(FK),UserID(FK),Text,CreatedAt
Тег (Tag),TagID(PK),Name(Unique)
Тег - Пост(PostTag),PostID(FK),TagID(FK)
Зв’язки між таблицями:

Користувач - Публікація (Один до багатьох): Один зареєстрований користувач може створювати необмежену кількість публікацій. Кожен пост жорстко прив'язаний до свого автора для відображення у стрічці та керування правами редагування.
Публікація - Коментар (Один до багатьох): Кожна публікація може збирати сотні відгуків від різних читачів. Коментар завжди належить лише одному конкретному посту.
Користувач - Коментар (Один до багатьох): Один користувач може коментувати як власні, так і чужі пости необмежену кількість разів.
Публікація - Тег (Багато до багатьох): Одна публікація може бути помічена кількома тегами для зручного пошуку, водночас один і той самий тег може використовуватися тисячами авторів у різних публікаціях. Цей зв'язок реалізований через проміжну таблицю PostTag.

🔐 Обмеження

Унікальність: Поля Email та NickName у сутності User є унікальними. Система не допускає створення двох профілів з однаковими даними.

Цілісність даних: Неможливо створити коментар, якщо в системі не існує автора або поста, до якого він пишеться. При видаленні поста всі пов'язані з ним коментарі та зв'язки з тегами видаляються автоматично.

Бізнес-правила: Коментар не може бути порожнім. Публікація обов'язково повинна мати заголовок та хоча б одного автора.

Висновок

В ході виконня лабораторної роботи ми навчилися проводити аналіз потреб користувача. Також ми навчилися створювати концепцію БД, і на її основі створювати ER діаграми. Також був створений список сутностей та атрибутів
